apache/nuttx/arch/arm/src/stm32h7/stm32_spi_slave.c
  /* 8- or 16-bit mode? */

  if (spi_9to16bitmode(priv))
    {
      /* 16-bit mode */

      priv->rxccr = SPI_RXDMA16_CONFIG;
    }
  else
    {
      /* 8-bit mode -- is there a buffer to receive data in? */

      priv->rxccr = SPI_RXDMA8_CONFIG;
    }

  /* Configure the RX DMA */

  /* This just transfers continuously to circular buffer */

  dmacfg.paddr = priv->spibase + STM32_SPI_RXDR_OFFSET;
  dmacfg.maddr = (uint32_t)priv->inq;
  dmacfg.ndata = CONFIG_STM32_SPI_SLAVE_QSIZE;
  dmacfg.cfg1  = priv->rxccr;
  dmacfg.cfg2  = 0;

  stm32_dmasetup(priv->rxdma, &dmacfg);
}
#endif

/****************************************************************************
 * Name: spi_dmatxsetup
 *
 * Description:
 *   Setup to perform TX DMA
 *
 ****************************************************************************/

#ifdef CONFIG_STM32_SPI_DMA
static void spi_dmatxsetup(struct stm32_spidev_s *priv, size_t nwords)
{
  /* TODO: set up dma to transfer out the new data from priv->outq,
   * which is set up in spi_enqueue
   * When the transfer is complete, update outq indexies accordingly
   */

#if 0
  stm32_dmacfg_t dmacfg;

  /* Can't transmit in rx only mode */

  if (priv->config == SIMPLEX_RX)
    {
      return;
    }

  /* 8- or 16-bit mode? */

  if (spi_9to16bitmode(priv))
    {
      /* 16-bit mode */

      priv->txccr = SPI_TXDMA16_CONFIG;
    }
  else
    {
      /* 8-bit mode */

      priv->txccr = SPI_TXDMA8_CONFIG;
    }

  dmacfg.paddr = priv->spibase + STM32_SPI_TXDR_OFFSET;
  dmacfg.maddr = (uint32_t)priv->outq[0];
  dmacfg.ndata = nwords;
  dmacfg.cfg1  = priv->txccr;
  dmacfg.cfg2  = 0;

  /* Setup the TX DMA */

  stm32_dmasetup(priv->txdma, &dmacfg);

#endif // 0
}
#endif

/****************************************************************************
 * Name: spi_dmarxstart
 *
 * Description:
 *   Start RX DMA. NB! This must be called before spi_dmatxstart
 *
 ****************************************************************************/

#ifdef CONFIG_STM32_SPI_DMA
static void spi_dmarxstart(struct stm32_spidev_s *priv)
{
  /* Can't receive in tx only mode */

  if (priv->config == SIMPLEX_TX)
    {
      return;
    }

  priv->rxresult = 0;

  spi_modifyreg(priv, STM32_SPI_CFG1_OFFSET, 0, SPI_CFG1_RXDMAEN);
  stm32_dmastart(priv->rxdma, spi_dmarxcallback, priv, false);
}
#endif

/****************************************************************************
 * Name: spi_dmatxstart
 *
 * Description:
 *   Start TX DMA. NB! This must be called after spi_dmarxstart
 *
 ****************************************************************************/

#ifdef CONFIG_STM32_SPI_DMA
static void spi_dmatxstart(struct stm32_spidev_s *priv)
{
  /* Can't transmit in rx only mode */

  if (priv->config == SIMPLEX_RX)
    {
      return;
    }

  priv->txresult = 0;
  stm32_dmastart(priv->txdma, spi_dmatxcallback, priv, false);
  spi_modifyreg(priv, STM32_SPI_CFG1_OFFSET, 0, SPI_CFG1_TXDMAEN);
}
#endif

/****************************************************************************
 * Name: spi_lock
 *
 * Description:
 *   Take or release the semaphore that enforces mutually exclusive access to
 *   SPI resources, handling any exceptional conditions
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   lock - true: Lock spi bus, false: unlock SPI bus
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static int spi_lock(struct spi_slave_ctrlr_s *ctrlr, bool lock)
{
  struct stm32_spidev_s *priv = (struct stm32_spidev_s *)ctrlr;
  int ret;

  if (lock)
    {
      /* Take the mutex (perhaps waiting) */

      ret = nxmutex_lock(&priv->lock);
    }
  else
    {
      ret = nxmutex_unlock(&priv->lock);
    }

  return ret;
}

/****************************************************************************
 * Name: spi_enable
 *
 * Description:
 *   Enable/disable the SPI peripheral
 *
 * Input Parameters:
 *   priv  - Device-specific state data
 *   state - true: enable, false: disable
 *
 ****************************************************************************/

static inline void spi_enable(struct stm32_spidev_s *priv, bool state)
{
  if (state == true)
    {
      /* Enable SPI */

      spi_modifyreg(priv, STM32_SPI_CR1_OFFSET, 0, SPI_CR1_SPE);
    }
  else
    {
      /* Disable SPI */

      spi_modifyreg(priv, STM32_SPI_CR1_OFFSET, SPI_CR1_SPE, 0);
    }
}

/****************************************************************************
 * Name: spi_setmode
 *
 * Description:
 *   Set the SPI mode.  see enum spi_mode_e for mode definitions
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   mode - The SPI mode requested
 *
 * Returned Value:
 *   Returns the actual frequency selected
 *
 ****************************************************************************/

static void spi_setmode(struct spi_slave_ctrlr_s *ctrlr,
                        enum spi_mode_e mode)
{
  struct stm32_spidev_s *priv = (struct stm32_spidev_s *)ctrlr;
  uint32_t setbits = 0;
  uint32_t clrbits = 0;

  spiinfo("mode=%d\n", mode);

  /* Has the mode changed? */

  if (mode != priv->mode)
    {
      /* Yes... Set CR1 appropriately */

      switch (mode)
        {
        case SPIDEV_MODE0: /* CPOL=0; CPHA=0 */
          setbits = 0;
          clrbits = SPI_CFG2_CPOL | SPI_CFG2_CPHA;
          break;

        case SPIDEV_MODE1: /* CPOL=0; CPHA=1 */
          setbits = SPI_CFG2_CPHA;
          clrbits = SPI_CFG2_CPOL;
          break;

        case SPIDEV_MODE2: /* CPOL=1; CPHA=0 */
          setbits = SPI_CFG2_CPOL;
          clrbits = SPI_CFG2_CPHA;
          break;

        case SPIDEV_MODE3: /* CPOL=1; CPHA=1 */
          setbits = SPI_CFG2_CPOL | SPI_CFG2_CPHA;
          clrbits = 0;
          break;

        default:
          return;
        }

      /* Change SPI mode */

      spi_modifyreg(priv, STM32_SPI_CFG2_OFFSET, clrbits, setbits);

      /* Save the mode so that subsequent re-configurations will be faster */

      priv->mode = mode;
    }
}

/****************************************************************************
 * Name: spi_setbits
 *
 * Description:
 *   Set the number of bits per word.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   nbits - The number of bits requested
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

