apache/nuttx/arch/arm/src/stm32h7/stm32_spi_slave.c
  /* Disable the SPI peripheral */

  spi_enable(priv, false);

  spi_lock(ctrlr, false);
}

/****************************************************************************
 * Name: spi_enqueue
 *
 * Description:
 *   Enqueue the next value to be shifted out from the interface. This adds
 *   the word the controller driver for a subsequent transfer but has no
 *   effect on any in-process or currently "committed" transfers.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *   data  - Pointer to the command/data mode data to be shifted out.
 *           The data width must be aligned to the nbits parameter which was
 *           previously provided to the bind() method.
 *   len   - Number of units of "nbits" wide to enqueue,
 *           "nbits" being the data width previously provided to the bind()
 *           method.
 *
 * Returned Value:
 *   Zero if the word was successfully queue; A negated errno valid is
 *   returned on any failure to enqueue the word (such as if the queue is
 *   full).
 *
 ****************************************************************************/

static int spi_enqueue(struct spi_slave_ctrlr_s *ctrlr,
                       const void *data, size_t len)
{
  return 0;
}

/****************************************************************************
 * Name: spi_qfull
 *
 * Description:
 *   Return true if the queue is full or false if there is space to add an
 *   additional word to the queue.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *
 * Returned Value:
 *   true if the output queue is full, false otherwise.
 *
 ****************************************************************************/

static bool spi_qfull(struct spi_slave_ctrlr_s *ctrlr)
{
  return false;
}

/****************************************************************************
 * Name: spi_qflush
 *
 * Description:
 *   Discard all saved values in the output queue. On return from this
 *   function the output queue will be empty. Any in-progress or otherwise
 *   "committed" output values may not be flushed.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void spi_qflush(struct spi_slave_ctrlr_s *ctrlr)
{
  struct stm32_spidev_s *priv = (struct stm32_spidev_s *)ctrlr;
  irqstate_t flags;

  DEBUGASSERT(priv != NULL && priv->dev != NULL);

#ifdef CONFIG_STM32_SPI_DMA
  if (!priv->dmarunning)
    {
      return;
    }
#endif

  /* Get exclusive access to the SPI device */

  spi_lock(ctrlr, true);
  flags = enter_critical_section();

  /* Flush the input buffers */

#ifdef CONFIG_STM32_SPI_DMA
  priv->ihead =
    CONFIG_STM32_SPI_SLAVE_QSIZE - stm32_dmaresidual(priv->rxdma);
#else
  priv->ihead = 0;
  priv->itail = 0;
#endif

  /* Flush the output buffers */

  priv->ohead = 0;
  priv->otail = 0;
  leave_critical_section(flags);
  spi_lock(ctrlr, false);
}

/****************************************************************************
 * Name: spi_rx_buffer_free
 *
 * Description:
 *   Handle buffer wrapping around & invalidate the previous buffer cache
 *
 * Input Parameters:
 *   ptr - pointer to the rx buffer
 *   start - start index of just received data
 *   end - end index of just received data
 *
 * Returned Value:
 *   new start index; 0 if buffer wrapped around, end otherwise
 *
 ****************************************************************************/

static inline int spi_rx_buffer_free(uint8_t *ptr, int start, int end)
{
  /* The priv->ihead can only be greater than qsize if the device driver
   * returns garbage
   */

  if (end >= CONFIG_STM32_SPI_SLAVE_QSIZE)
    {
      end = 0;
      up_invalidate_dcache((uintptr_t)&ptr[start],
                           (uintptr_t)&ptr[CONFIG_STM32_SPI_SLAVE_QSIZE]);
    }
  else
    {
      up_invalidate_dcache((uintptr_t)&ptr[start],
                           (uintptr_t)&ptr[end]);
    }

  return end;
}

/****************************************************************************
 * Name: spi_qpoll
 *
 * Description:
 *   Tell the controller to output all the receive queue data.
 *
 * Input Parameters:
 *   ctrlr - SPI Slave controller interface instance
 *
 * Returned Value:
 *   Number of bytes left in the rx queue. If the device accepted all the
 *
 ****************************************************************************/

static size_t spi_qpoll(struct spi_slave_ctrlr_s *ctrlr)
{
  struct stm32_spidev_s *priv = (struct stm32_spidev_s *)ctrlr;
  int itail;
  int ihead;
  uint16_t bytes_left;

  DEBUGASSERT(priv != NULL && priv->dev != NULL);
  DEBUGASSERT(priv->ihead < CONFIG_STM32_SPI_SLAVE_QSIZE);

#ifdef CONFIG_STM32_SPI_DMA
  if (!priv->dmarunning)
    {
      return 0;
    }
#endif

  /* Get exclusive access to the SPI device */

  spi_lock(ctrlr, true);

#ifdef CONFIG_STM32_SPI_DMA
  itail = CONFIG_STM32_SPI_SLAVE_QSIZE - stm32_dmaresidual(priv->rxdma);
#else
  #error Support only simplex mode rx with dma
#endif

  /* Receive all data between last read index and the current index */

  ihead = priv->ihead;
  if (ihead > itail)
    {
      /* Receive the end of receive buffer */

      priv->ihead += SPIS_DEV_RECEIVE(priv->dev,
                                      (const uint16_t *)&priv->inq[ihead],
                                      CONFIG_STM32_SPI_SLAVE_QSIZE -
                                        ihead);

      /* Invalidate dcache and wrap around the priv->ihead */

      priv->ihead = spi_rx_buffer_free(priv->inq, ihead, priv->ihead);
    }

  ihead = priv->ihead;
  if (ihead < itail)
    {
      /* Receive the data between ihead and itail */

      priv->ihead += SPIS_DEV_RECEIVE(priv->dev,
                                      (const uint16_t *)&priv->inq[ihead],
                                      itail - ihead);

      /* Invalidate dcache and wrap around the priv->ihead */

      priv->ihead = spi_rx_buffer_free(priv->inq, ihead, priv->ihead);
    }

  /* Calculate the number of bytes left in the buffer */

  bytes_left = itail < priv->ihead
    ? CONFIG_STM32_SPI_SLAVE_QSIZE - priv->ihead + itail
    : itail - priv->ihead;

  spi_lock(ctrlr, false);

  return bytes_left;
}

/****************************************************************************
 * Name: spi_pm_prepare
 *
 * Description:
 *   Request the driver to prepare for a new power state. This is a
 *   warning that the system is about to enter into a new power state.  The
 *   driver should begin whatever operations that may be required to enter
 *   power state.  The driver may abort the state change mode by returning
 *   a non-zero value from the callback function.
 *
 * Input Parameters:
 *   cb      - Returned to the driver.  The driver version of the callback
 *             structure may include additional, driver-specific state
 *             data at the end of the structure.
 *   domain  - Identifies the activity domain of the state change
 *   pmstate - Identifies the new PM state
 *
 * Returned Value:
 *   0 (OK) means the event was successfully processed and that the driver
 *   is prepared for the PM state change.  Non-zero means that the driver
 *   is not prepared to perform the tasks needed achieve this power setting
 *   and will cause the state change to be aborted.  NOTE:  The prepare
 *   method will also be recalled when reverting from lower back to higher
 *   power consumption modes (say because another driver refused a lower
 *   power state change).  Drivers are not permitted to return non-zero
 *   values when reverting back to higher power consumption modes!
 *
 ****************************************************************************/

